from random import randint

answers = [
    "Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да", "Можешь быть уверен в этом", "Мне кажется - да",
    "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да", "Пока неясно, попробуй снова",
    "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать", "Сконцентрируйся и спроси опять",
    "Даже не думай", "Мой ответ - нет", "По моим данным - нет", "Перспективы не очень хорошие", "Весьма сомнительно"
]


def greeting():
    """
    Приветствие.
    """
    print("Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.")
    print("Как тебя зовут?")
    print(f"Привет, {input()}")


def asking():
    """
    Вопрос Магическому шару.
    """
    flag = True
    while flag:
        print("Задай свой вопрос:")
        input()
        print(answers[randint(0, 20)])
        print("Хочешь задать еще один вопрос? Введи Y или N:")

        while flag:
            y_n = input()
            if y_n.upper() in "N":
                print("Возвращайся если возникнут вопросы!")
                flag = False
                break
            elif y_n.lower() in "Y":
                break
            else:
                print("Ты ввёл неправильно. Хочешь задать еще один вопрос? Введи y или n")


def main():
    greeting()
    asking()


if __name__ == '__main__':
    main()
